{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "bd0bdefa-e3fc-4147-92c9-115327142a5f",
   "metadata": {},
   "source": [
    "# Trabajo Integrador Base de Datos 2025"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d49ccc27-bd68-4b98-acfc-b6bb400b450c",
   "metadata": {},
   "source": [
    "## Cargamos MongoDB, Redis y Neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "6870a9cb-5bb9-4139-aebf-3c7e24eae9fc",
   "metadata": {},
   "outputs": [],
   "source": [
    "from pymongo import MongoClient\n",
    "client = MongoClient(\"mongodb://admin:admin123@mongo:27017/\")\n",
    "db = client[\"data\"]\n",
    "\n",
    "from neo4j import GraphDatabase\n",
    "driver = GraphDatabase.driver(\"bolt://neo4j:7687\",\n",
    "auth=(\"neo4j\", \"neo4j123\"))\n",
    "\n",
    "import redis\n",
    "r = redis.Redis(host=\"redis\", port=6379, password=\"redis123\",\n",
    "decode_responses=True)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6efda1dc-9abd-45b6-bf54-cb107438d805",
   "metadata": {},
   "source": [
    "<br>"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0843c794-64cd-4334-b3a1-951532d6973b",
   "metadata": {},
   "source": [
    "## 1. Carga de datos inicial"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5237e0f3-8277-464a-a3dc-8a4cf91765a1",
   "metadata": {},
   "source": [
    "### Carga de datos en MongoDB"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a9156bea-9750-4ce0-8e13-7b541e972451",
   "metadata": {},
   "source": [
    "#### a. Carga de usuarios"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "5a8ea040-f2f1-4d4d-9b67-76cac6fa7063",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "InsertManyResult([ObjectId('68f552cc940d1054a363f84d'), ObjectId('68f552cc940d1054a363f84e'), ObjectId('68f552cc940d1054a363f84f'), ObjectId('68f552cc940d1054a363f850'), ObjectId('68f552cc940d1054a363f851'), ObjectId('68f552cc940d1054a363f852'), ObjectId('68f552cc940d1054a363f853'), ObjectId('68f552cc940d1054a363f854'), ObjectId('68f552cc940d1054a363f855'), ObjectId('68f552cc940d1054a363f856'), ObjectId('68f552cc940d1054a363f857'), ObjectId('68f552cc940d1054a363f858'), ObjectId('68f552cc940d1054a363f859'), ObjectId('68f552cc940d1054a363f85a')], acknowledged=True)"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "usuarios = [\n",
    "{\"usuario_id\": 1, \"nombre\": \"María Pérez\", \"email\": \"maria.perez@gmail.com\", \"telefono\": \"+54 11 4567 1234\"},\n",
    "{\"usuario_id\": 2, \"nombre\": \"Juan López\", \"email\": \"juan.lopez@yahoo.com\", \"telefono\": \"+54 221 334 5566\"},\n",
    "{\"usuario_id\": 3, \"nombre\": \"Carla Gómez\", \"email\": \"carla.gomez@hotmail.com\", \"telefono\": \"+54 261 789 2233\"},\n",
    "{\"usuario_id\": 4, \"nombre\": \"Luis Fernández\", \"email\": \"luis.fernandez@hotmail.com\", \"telefono\": \"+54 299 444 9988\"},\n",
    "{\"usuario_id\": 5, \"nombre\": \"Ana Torres\", \"email\": \"ana.torres@gmail.com\", \"telefono\": \"+54 381 123 4567\"},\n",
    "{\"usuario_id\": 6, \"nombre\": \"Facundo López\", \"email\": \"facundo.lopez@gmail.com\", \"telefono\": \"+54 221 597 0204\"},\n",
    "{\"usuario_id\": 7, \"nombre\": \"Hernán López\", \"email\": \"hernan.lopez@gmail.com\", \"telefono\": \"+54 221 456 7832\"},\n",
    "{\"usuario_id\": 8, \"nombre\": \"Emilio Cerrate\", \"email\": \"emicerrate@hotmail.com\", \"telefono\": \"+54 221 321 5897\"},\n",
    "{\"usuario_id\": 9, \"nombre\": \"Juan Pablo Moreno\", \"email\": \"morenojuanpa@yahoo.com\", \"telefono\": \"+54 11 4178 2885\"},\n",
    "{\"usuario_id\": 10, \"nombre\": \"Pilar Agustina Basso\", \"email\": \"bassopilar@hotmail.com\", \"telefono\": \"+54 381 983 6623\"},\n",
    "{\"usuario_id\": 11, \"nombre\": \"Guido Marcelo Carrillo\", \"email\": \"guidocarrillo@gmail.com\", \"telefono\": \"+54 221 445 5696\"},\n",
    "{\"usuario_id\": 12, \"nombre\": \"Franco Urricelqui\", \"email\": \"franco.urricelqui@gmail.com\", \"telefono\": \"+54 221 348 1144\"},\n",
    "{\"usuario_id\": 13, \"nombre\": \"Jalen Brunson\", \"email\": \"jalenbrunson@hotmail.com\", \"telefono\": \"+1 212 6332 7888\"},\n",
    "{\"usuario_id\": 14, \"nombre\": \"Josh Hart\", \"email\": \"hart.josh@gmail.com\", \"telefono\": \"+1 212 8445 5236\"}\n",
    "]\n",
    "\n",
    "db.usuarios.insert_many(usuarios)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e62a1a89-5173-4053-af5f-5069ecef7684",
   "metadata": {},
   "source": [
    "#### b. Carga de destinos"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "bb9cea74-0cfe-4fa3-9b7e-611fa14896d9",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "InsertManyResult([ObjectId('68f552cc940d1054a363f85b'), ObjectId('68f552cc940d1054a363f85c'), ObjectId('68f552cc940d1054a363f85d'), ObjectId('68f552cc940d1054a363f85e'), ObjectId('68f552cc940d1054a363f85f'), ObjectId('68f552cc940d1054a363f860'), ObjectId('68f552cc940d1054a363f861'), ObjectId('68f552cc940d1054a363f862'), ObjectId('68f552cc940d1054a363f863'), ObjectId('68f552cc940d1054a363f864'), ObjectId('68f552cc940d1054a363f865'), ObjectId('68f552cc940d1054a363f866')], acknowledged=True)"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "destinos = [\n",
    "{\"destino_id\": 1, \"ciudad\": \"Bariloche\", \"pais\": \"Argentina\", \"tipo\": \"Montaña\", \"precio_promedio\": 102500},\n",
    "{\"destino_id\": 2, \"ciudad\": \"Cancún\", \"pais\": \"México\", \"tipo\": \"Playa\", \"precio_promedio\": 150000},\n",
    "{\"destino_id\": 3, \"ciudad\": \"Madrid\", \"pais\": \"España\", \"tipo\": \"Cultural\", \"precio_promedio\": 125000},\n",
    "{\"destino_id\": 4, \"ciudad\": \"Roma\", \"pais\": \"Italia\", \"tipo\": \"Histórico\", \"precio_promedio\": 100000},\n",
    "{\"destino_id\": 5, \"ciudad\": \"Mendoza\", \"pais\": \"Argentina\", \"tipo\": \"Vinos\", \"precio_promedio\": 85000},\n",
    "{\"destino_id\": 6, \"ciudad\": \"Jujuy\", \"pais\": \"Argentina\", \"tipo\": \"Montaña\", \"precio_promedio\": 60000},\n",
    "{\"destino_id\": 7, \"ciudad\": \"Córdoba\", \"pais\": \"Argentina\", \"tipo\": \"Cultural\", \"precio_promedio\": 70000},\n",
    "{\"destino_id\": 8, \"ciudad\": \"París\", \"pais\": \"Francia\", \"tipo\": \"Cultural\", \"precio_promedio\": 110000},\n",
    "{\"destino_id\": 9, \"ciudad\": \"Salta\", \"pais\": \"Argentina\", \"tipo\": \"Montaña\", \"precio_promedio\": 65000},\n",
    "{\"destino_id\": 10, \"ciudad\": \"Florianópolis\", \"pais\": \"Brasil\", \"tipo\": \"Playa\", \"precio_promedio\": 80000},\n",
    "{\"destino_id\": 11, \"ciudad\": \"Ushuaia\", \"pais\": \"Argentina\", \"tipo\": \"Glaciar\", \"precio_promedio\": 90000},\n",
    "{\"destino_id\": 12, \"ciudad\": \"Tucumán\", \"pais\": \"Argentina\", \"tipo\": \"Cultural\", \"precio_promedio\": 55000}\n",
    "]\n",
    "\n",
    "db.destinos.insert_many(destinos)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d66b2d89-3b09-49fb-98df-ad231de80ae1",
   "metadata": {},
   "source": [
    "#### c. Carga de hoteles"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "f7f3d0d0-697f-4b62-95cc-0eb463ad65cb",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "InsertManyResult([ObjectId('68f552cc940d1054a363f867'), ObjectId('68f552cc940d1054a363f868'), ObjectId('68f552cc940d1054a363f869'), ObjectId('68f552cc940d1054a363f86a'), ObjectId('68f552cc940d1054a363f86b'), ObjectId('68f552cc940d1054a363f86c'), ObjectId('68f552cc940d1054a363f86d'), ObjectId('68f552cc940d1054a363f86e'), ObjectId('68f552cc940d1054a363f86f'), ObjectId('68f552cc940d1054a363f870'), ObjectId('68f552cc940d1054a363f871'), ObjectId('68f552cc940d1054a363f872'), ObjectId('68f552cc940d1054a363f873'), ObjectId('68f552cc940d1054a363f874'), ObjectId('68f552cc940d1054a363f875')], acknowledged=True)"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "hoteles = [\n",
    "{\"hotel_id\": 1, \"nombre\": \"Hotel Sol\", \"ciudad\": \"Bariloche\", \"precio\": 85000, \"calificacion\": 4, \"servicios\": [\"wifi\", \"pileta\", \"desayuno\"]},\n",
    "{\"hotel_id\": 2, \"nombre\": \"Cumbres Andinas\", \"ciudad\": \"Bariloche\", \"precio\": 120000, \"calificacion\": 5, \"servicios\": [\"wifi\", \"spa\", \"pileta\"]},\n",
    "{\"hotel_id\": 3, \"nombre\": \"Altos del Norte\", \"ciudad\": \"Jujuy\", \"precio\": 60000, \"calificacion\": 3, \"servicios\": [\"wifi\"]},\n",
    "{\"hotel_id\": 4, \"nombre\": \"Montaña Real\", \"ciudad\": \"Mendoza\", \"precio\": 85000, \"calificacion\": 4, \"servicios\": [\"wifi\", \"pileta\"]},\n",
    "{\"hotel_id\": 5, \"nombre\": \"Estancia Colonial\", \"ciudad\": \"Córdoba\", \"precio\": 70000, \"calificacion\": 4, \"servicios\": [\"wifi\", \"desayuno\"]},\n",
    "{\"hotel_id\": 6, \"nombre\": \"Royal Caribbean\", \"ciudad\": \"Cancún\", \"precio\": 150000, \"calificacion\": 5, \"servicios\": [\"wifi\", \"desayuno\", \"pileta\", \"gimnasio\"]},\n",
    "{\"hotel_id\": 7, \"nombre\": \"Mandarin Oriental Ritz\", \"ciudad\": \"Madrid\", \"precio\": 180000, \"calificacion\": 5, \"servicios\": [\"wifi\", \"desayuno\", \"pileta\", \"gimnasio\"]},\n",
    "{\"hotel_id\": 8, \"nombre\": \"Casa du Soleil\", \"ciudad\": \"Madrid\", \"precio\": 70000, \"calificacion\": 3, \"servicios\": [\"wifi\"]},\n",
    "{\"hotel_id\": 9, \"nombre\": \"Sei Sensi\", \"ciudad\": \"Roma\", \"precio\": 100000, \"calificacion\": 4, \"servicios\": [\"wifi\", \"desayuno\"]},\n",
    "{\"hotel_id\": 10, \"nombre\": \"Étudiants\", \"ciudad\": \"París\", \"precio\": 150000, \"calificacion\": 5, \"servicios\": [\"wifi\", \"desayuno\", \"pileta\", \"gimnasio\"]},\n",
    "{\"hotel_id\": 11, \"nombre\": \"Escrime\", \"ciudad\": \"París\", \"precio\": 70000, \"calificacion\": 3, \"servicios\": [\"wifi\"]},\n",
    "{\"hotel_id\": 12, \"nombre\": \"Gran Montaña\", \"ciudad\": \"Salta\", \"precio\": 65000, \"calificacion\": 4, \"servicios\": [\"wifi\", \"desayuno\"]},\n",
    "{\"hotel_id\": 13, \"nombre\": \"Foda Louca\", \"ciudad\": \"Florianópolis\", \"precio\": 80000, \"calificacion\": 4, \"servicios\": [\"wifi\", \"desayuno\", \"pileta\", \"gimnasio\"]},\n",
    "{\"hotel_id\": 14, \"nombre\": \"Alto Andino\", \"ciudad\": \"Ushuaia\", \"precio\": 90000, \"calificacion\": 4, \"servicios\": [\"wifi\", \"desayuno\"]},\n",
    "{\"hotel_id\": 15, \"nombre\": \"Gran Maestro\", \"ciudad\": \"Tucumán\", \"precio\": 55000, \"calificacion\": 3, \"servicios\": [\"wifi\"]}\n",
    "]\n",
    "\n",
    "db.hoteles.insert_many(hoteles)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "61b95136-d03c-42d2-a3ab-a1af2abdf948",
   "metadata": {},
   "source": [
    "#### d. Carga de actividades"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "140180ae-a501-4374-9823-dc78c2655c53",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "InsertManyResult([ObjectId('68f552cd940d1054a363f876'), ObjectId('68f552cd940d1054a363f877'), ObjectId('68f552cd940d1054a363f878'), ObjectId('68f552cd940d1054a363f879'), ObjectId('68f552cd940d1054a363f87a'), ObjectId('68f552cd940d1054a363f87b'), ObjectId('68f552cd940d1054a363f87c'), ObjectId('68f552cd940d1054a363f87d'), ObjectId('68f552cd940d1054a363f87e'), ObjectId('68f552cd940d1054a363f87f'), ObjectId('68f552cd940d1054a363f880'), ObjectId('68f552cd940d1054a363f881'), ObjectId('68f552cd940d1054a363f882'), ObjectId('68f552cd940d1054a363f883'), ObjectId('68f552cd940d1054a363f884'), ObjectId('68f552cd940d1054a363f885'), ObjectId('68f552cd940d1054a363f886')], acknowledged=True)"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "actividades = [\n",
    "{\"actividad_id\": 1, \"nombre\": \"Caminata en glaciares\", \"tipo\": \"aventura\", \"ciudad\": \"Bariloche\", \"precio\": 45000},\n",
    "{\"actividad_id\": 2, \"nombre\": \"Degustación de vinos\", \"tipo\": \"cultura\", \"ciudad\": \"Mendoza\", \"precio\": 30000},\n",
    "{\"actividad_id\": 3, \"nombre\": \"Tour por cerros\", \"tipo\": \"aventura\", \"ciudad\": \"Jujuy\", \"precio\": 25000},\n",
    "{\"actividad_id\": 4, \"nombre\": \"Recorrido histórico\", \"tipo\": \"cultura\", \"ciudad\": \"Córdoba\", \"precio\": 20000},\n",
    "{\"actividad_id\": 5, \"nombre\": \"Excursión en 4x4\", \"tipo\": \"aventura\", \"ciudad\": \"Salta\", \"precio\": 55000},\n",
    "{\"actividad_id\": 6, \"nombre\": \"Tirolesa en las montañas\", \"tipo\": \"aventura\", \"ciudad\": \"Bariloche\", \"precio\": 45000},\n",
    "{\"actividad_id\": 7, \"nombre\": \"Snorkel en arrecifes\", \"tipo\": \"aventura\", \"ciudad\": \"Cancún\", \"precio\": 68000},\n",
    "{\"actividad_id\": 8, \"nombre\": \"Visita al Coliseo\", \"tipo\": \"historia\", \"ciudad\": \"Roma\", \"precio\": 85000},\n",
    "{\"actividad_id\": 9, \"nombre\": \"Tour gastronómico por Trastevere\", \"tipo\": \"cultura\", \"ciudad\": \"Roma\", \"precio\": 65000},\n",
    "{\"actividad_id\": 10, \"nombre\": \"Tour por el Louvre\", \"tipo\": \"cultura\", \"ciudad\": \"París\", \"precio\": 120000},\n",
    "{\"actividad_id\": 11, \"nombre\": \"Crucero por el Sena\", \"tipo\": \"relax\", \"ciudad\": \"París\", \"precio\": 45000},\n",
    "{\"actividad_id\": 12, \"nombre\": \"Tour por el Museo del Prado\", \"tipo\": \"cultura\", \"ciudad\": \"Madrid\", \"precio\": 100000},\n",
    "{\"actividad_id\": 13, \"nombre\": \"Visita al Palacio Real\", \"tipo\": \"historia\", \"ciudad\": \"Madrid\", \"precio\": 70000},\n",
    "{\"actividad_id\": 14, \"nombre\": \"Paseo en buggy por las dunas\", \"tipo\": \"aventura\", \"ciudad\": \"Florianópolis\", \"precio\": 45000},\n",
    "{\"actividad_id\": 15, \"nombre\": \"Visita a las Ruinas de Quilmes\", \"tipo\": \"cultura\", \"ciudad\": \"Tucumán\", \"precio\": 25000},\n",
    "{\"actividad_id\": 16, \"nombre\": \"Navegación por el Canal Beagle\", \"tipo\": \"aventura\", \"ciudad\": \"Ushuaia\", \"precio\": 60000},\n",
    "{\"actividad_id\": 17, \"nombre\": \"Excursión al Parque Nacional Tierra del Fuego\", \"tipo\": \"naturaleza\", \"ciudad\": \"Ushuaia\", \"precio\": 55000}\n",
    "]\n",
    "\n",
    "db.actividades.insert_many(actividades)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3308c5b1-4d27-4252-a8d4-bdb7c1121852",
   "metadata": {},
   "source": [
    "#### e. Carga de reservas"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "5e245eda-5feb-435e-9f6b-55507f5d6e24",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "InsertManyResult([ObjectId('68f552cd940d1054a363f887'), ObjectId('68f552cd940d1054a363f888'), ObjectId('68f552cd940d1054a363f889'), ObjectId('68f552cd940d1054a363f88a'), ObjectId('68f552cd940d1054a363f88b'), ObjectId('68f552cd940d1054a363f88c'), ObjectId('68f552cd940d1054a363f88d'), ObjectId('68f552cd940d1054a363f88e'), ObjectId('68f552cd940d1054a363f88f'), ObjectId('68f552cd940d1054a363f890'), ObjectId('68f552cd940d1054a363f891'), ObjectId('68f552cd940d1054a363f892'), ObjectId('68f552cd940d1054a363f893'), ObjectId('68f552cd940d1054a363f894'), ObjectId('68f552cd940d1054a363f895'), ObjectId('68f552cd940d1054a363f896'), ObjectId('68f552cd940d1054a363f897')], acknowledged=True)"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "reservas = [\n",
    "{\"reserva_id\": 1, \"usuario_id\": 1, \"destino_id\": 2, \"fecha_reserva\": \"2025-07-01\", \"estado\": \"Confirmada\", \"precio_total\": 150000},\n",
    "{\"reserva_id\": 2, \"usuario_id\": 2, \"destino_id\": 1, \"fecha_reserva\": \"2025-06-15\", \"estado\": \"Pagada\", \"precio_total\": 165000},\n",
    "{\"reserva_id\": 3, \"usuario_id\": 3, \"destino_id\": 3, \"fecha_reserva\": \"2025-05-20\", \"estado\": \"Cancelada\", \"precio_total\": 125000},\n",
    "{\"reserva_id\": 4, \"usuario_id\": 1, \"destino_id\": 4, \"fecha_reserva\": \"2025-07-10\", \"estado\": \"Pendiente\", \"precio_total\": 100000},\n",
    "{\"reserva_id\": 5, \"usuario_id\": 5, \"destino_id\": 5, \"fecha_reserva\": \"2025-06-25\", \"estado\": \"Confirmada\", \"precio_total\": 115000},\n",
    "{\"reserva_id\": 6, \"usuario_id\": 10, \"destino_id\": 10, \"fecha_reserva\": \"2025-07-30\", \"estado\": \"Pendiente\", \"precio_total\": 80000},\n",
    "{\"reserva_id\": 7, \"usuario_id\": 14, \"destino_id\": 7, \"fecha_reserva\": \"2025-08-20\", \"estado\": \"Pendiente\", \"precio_total\": 70000},\n",
    "{\"reserva_id\": 8, \"usuario_id\": 7, \"destino_id\": 8, \"fecha_reserva\": \"2025-08-02\", \"estado\": \"Confirmada\", \"precio_total\": 270000},\n",
    "{\"reserva_id\": 9, \"usuario_id\": 12, \"destino_id\": 2, \"fecha_reserva\": \"2025-09-11\", \"estado\": \"Cancelada\", \"precio_total\": 218000},\n",
    "{\"reserva_id\": 10, \"usuario_id\": 3, \"destino_id\": 3, \"fecha_reserva\": \"2025-09-03\", \"estado\": \"Pagada\", \"precio_total\": 180000},\n",
    "{\"reserva_id\": 11, \"usuario_id\": 7, \"destino_id\": 9, \"fecha_reserva\": \"2025-06-14\", \"estado\": \"Confirmada\", \"precio_total\": 65000},\n",
    "{\"reserva_id\": 12, \"usuario_id\": 9, \"destino_id\": 4, \"fecha_reserva\": \"2025-05-25\", \"estado\": \"Confirmada\", \"precio_total\": 185000},\n",
    "{\"reserva_id\": 13, \"usuario_id\": 12, \"destino_id\": 6, \"fecha_reserva\": \"2025-12-12\", \"estado\": \"Pendiente\", \"precio_total\": 85000},\n",
    "{\"reserva_id\": 14, \"usuario_id\": 8, \"destino_id\": 6, \"fecha_reserva\": \"2025-12-09\", \"estado\": \"Confirmada\", \"precio_total\": 60000},\n",
    "{\"reserva_id\": 15, \"usuario_id\": 2, \"destino_id\": 10, \"fecha_reserva\": \"2025-12-18\", \"estado\": \"Pendiente\", \"precio_total\": 125000},\n",
    "{\"reserva_id\": 16, \"usuario_id\": 5, \"destino_id\": 11, \"fecha_reserva\": \"2025-03-17\", \"estado\": \"Pagada\", \"precio_total\": 145000},\n",
    "{\"reserva_id\": 17, \"usuario_id\": 4, \"destino_id\": 12, \"fecha_reserva\": \"2025-04-28\", \"estado\": \"Cancelada\", \"precio_total\": 90000}\n",
    "]\n",
    "\n",
    "db.reservas.insert_many(reservas)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1eea23e5-0d03-4907-b721-24d90bdaa1ce",
   "metadata": {},
   "source": [
    "<br>"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "25da6759-7a0e-40c5-88ad-ecabf7e199a8",
   "metadata": {},
   "source": [
    "### Carga de datos en Neo4j"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "618b2ed1-a23c-42a1-9d8a-646cca1d2a98",
   "metadata": {},
   "source": [
    "#### a. Carga de usuarios\n",
    "#### b. Carga de destinos\n",
    "#### i. Carga de relaciones entre usuarios y destinos\n",
    "#### j. Carga de relaciones entre usuarios y usuarios"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "891bfda3-b972-43e1-91a5-5c259c10baec",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x783fc200f510>"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query= \"\"\"MERGE (m:Usuario {usuario_id:1, nombre:'María Pérez'})\n",
    "MERGE (jl:Usuario {usuario_id:2, nombre:'Juan López'})\n",
    "MERGE (c:Usuario {usuario_id:3, nombre:'Carla Gómez'})\n",
    "MERGE (l:Usuario {usuario_id:4, nombre:'Luis Fernández'})\n",
    "MERGE (a:Usuario {usuario_id:5, nombre:'Ana Torres'})\n",
    "MERGE (fl:Usuario {usuario_id:6, nombre:'Facundo López'})\n",
    "MERGE (h:Usuario {usuario_id:7, nombre:'Hernán López'})\n",
    "MERGE (e:Usuario {usuario_id:8, nombre:'Emilio Cerrate'})\n",
    "MERGE (jp:Usuario {usuario_id:9, nombre:'Juan Pablo Moreno'})\n",
    "MERGE (p:Usuario {usuario_id:10, nombre:'Pilar Agustina Basso'})\n",
    "MERGE (g:Usuario {usuario_id:11, nombre:'Guido Marcelo Carrillo'})\n",
    "MERGE (fu:Usuario {usuario_id:12, nombre:'Franco Urricelqui'})\n",
    "MERGE (jb:Usuario {usuario_id:13, nombre:'Jalen Brunson'})\n",
    "MERGE (jh:Usuario {usuario_id:14, nombre:'Josh Hart'})\n",
    "\n",
    "MERGE (d1:Destino {destino_id:1, ciudad:'Bariloche', pais:'Argentina'})\n",
    "MERGE (d2:Destino {destino_id:2, ciudad:'Cancún', pais:'México'})\n",
    "MERGE (d3:Destino {destino_id:3, ciudad:'Madrid', pais:'España'})\n",
    "MERGE (d4:Destino {destino_id:4, ciudad:'Roma', pais:'Italia'})\n",
    "MERGE (d5:Destino {destino_id:5, ciudad:'Mendoza', pais:'Argentina'})\n",
    "MERGE (d6:Destino {destino_id:6, ciudad:'Jujuy', pais:'Argentina'})\n",
    "MERGE (d7:Destino {destino_id:7, ciudad:'Córdoba', pais:'Argentina'})\n",
    "MERGE (d8:Destino {destino_id:8, ciudad:'París', pais:'Francia'})\n",
    "MERGE (d9:Destino {destino_id:9, ciudad:'Salta', pais:'Argentina'})\n",
    "MERGE (d10:Destino {destino_id:10, ciudad:'Florianópolis', pais:'Brasil'})\n",
    "MERGE (d11:Destino {destino_id:11, ciudad:'Ushuaia', pais:'Argentina'})\n",
    "MERGE (d12:Destino {destino_id:12, ciudad:'Tucumán', pais:'Argentina'})\n",
    "\n",
    "MERGE (m)-[:VISITO]->(d1)\n",
    "MERGE (m)-[:VISITO]->(d5)\n",
    "MERGE (jl)-[:VISITO]->(d1)\n",
    "MERGE (c)-[:VISITO]->(d3)\n",
    "MERGE (l)-[:VISITO]->(d2)\n",
    "MERGE (a)-[:VISITO]->(d1)\n",
    "MERGE (a)-[:VISITO]->(d4)\n",
    "MERGE (e)-[:VISITO]->(d2)\n",
    "MERGE (e)-[:VISITO]->(d1)\n",
    "MERGE (e)-[:VISITO]->(d5)\n",
    "MERGE (e)-[:VISITO]->(d7)\n",
    "MERGE (fu)-[:VISITO]->(d1)\n",
    "MERGE (fu)-[:VISITO]->(d3)\n",
    "MERGE (fu)-[:VISITO]->(d4)\n",
    "MERGE (fu)-[:VISITO]->(d8)\n",
    "MERGE (fu)-[:VISITO]->(d11)\n",
    "MERGE (jb)-[:VISITO]->(d2)\n",
    "MERGE (jb)-[:VISITO]->(d8)\n",
    "MERGE (jh)-[:VISITO]->(d2)\n",
    "MERGE (jh)-[:VISITO]->(d8)\n",
    "MERGE (fl)-[:VISITO]->(d10)\n",
    "MERGE (h)-[:VISITO]->(d10)\n",
    "MERGE (g)-[:VISITO]->(d6)\n",
    "MERGE (g)-[:VISITO]->(d12)\n",
    "MERGE (jp)-[:VISITO]->(d10)\n",
    "MERGE (a)-[:VISITO]->(d7)\n",
    "MERGE (g)-[:VISITO]->(d8)\n",
    "\n",
    "MERGE (m)-[:AMIGO_DE]->(jl)\n",
    "MERGE (jl)-[:AMIGO_DE]->(m)\n",
    "MERGE (c)-[:FAMILIAR_DE]->(l)\n",
    "MERGE (l)-[:FAMILIAR_DE]->(c)\n",
    "MERGE (a)-[:AMIGO_DE]->(l)\n",
    "MERGE (jl)-[:FAMILIAR_DE]->(fl)\n",
    "MERGE (fl)-[:FAMILIAR_DE]->(jl)\n",
    "MERGE (h)-[:FAMILIAR_DE]->(jl)\n",
    "MERGE (jl)-[:FAMILIAR_DE]->(h)\n",
    "MERGE (h)-[:FAMILIAR_DE]->(fl)\n",
    "MERGE (fl)-[:FAMILIAR_DE]->(h)\n",
    "MERGE (fu)-[:AMIGO_DE]->(e)\n",
    "MERGE (e)-[:AMIGO_DE]->(fu)\n",
    "MERGE (e)-[:AMIGO_DE]->(jp)\n",
    "MERGE (jp)-[:AMIGO_DE]->(e)\n",
    "MERGE (fu)-[:PAREJA_DE]->(c)\n",
    "MERGE (c)-[:PAREJA_DE]->(fu)\n",
    "MERGE (e)-[:PAREJA_DE]->(p)\n",
    "MERGE (p)-[:PAREJA_DE]->(e)\n",
    "MERGE (jb)-[:AMIGO_DE]->(jh)\n",
    "MERGE (jh)-[:AMIGO_DE]->(jb)\n",
    "MERGE (a)-[:AMIGO_DE]->(p)\n",
    "MERGE (p)-[:AMIGO_DE]->(a)\n",
    "MERGE (g)-[:AMIGO_DE]->(l)\n",
    "\"\"\"\n",
    "driver.session().run(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "78eee824-ce91-4fd9-a803-7e8437ffa7c4",
   "metadata": {},
   "source": [
    "<br>"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "dc19140f-cbb7-4f4f-b306-6ddae5e8e158",
   "metadata": {},
   "source": [
    "### Carga de datos en Redis"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7475de18-e0f1-4412-a211-f35549477b95",
   "metadata": {},
   "source": [
    "#### f. Caché de búsquedas"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8070d8af-3a53-4713-8f3b-4088de2c213f",
   "metadata": {},
   "source": [
    "#### g. Usuarios conectados"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "aea56428-5b0c-4add-95bd-f403616e0a5e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "r.set(\"usuario:2:sesion\", \"activa\", ex=600)\n",
    "r.set(\"usuario:4:sesion\", \"activa\", ex=300)\n",
    "r.set(\"usuario:5:sesion\", \"activa\", ex=1200)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c07a99f4-6066-44f1-8b46-9850da45fb5a",
   "metadata": {},
   "source": [
    "#### h. Reservas temporales"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "fd85455e-2cde-4f48-a979-9b900e2cba7f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "r.hset(\"usuario:2:reserva\", mapping={\"id_reserva\": \"6\", \"destino_id\": \"5\", \"fecha_reserva\": \"17-10-2025\"})\n",
    "r.hset(\"usuario:5:reserva\", mapping={\"id_reserva\": \"7\", \"destino_id\": \"3\", \"fecha_reserva\": \"20-10-2025\"})"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "79c84ae2",
   "metadata": {},
   "source": [
    "## 2. Consultas"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e3c46366",
   "metadata": {},
   "source": [
    "#### a. Usuarios que visitaron 'Bariloche'."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "69377c39-0708-4cd3-8905-0f3361104046",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Visitaron Bariloche:\n",
      "Ana Torres\n",
      "Franco Urricelqui\n",
      "Emilio Cerrate\n",
      "Juan López\n",
      "María Pérez\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (n)-[:VISITO]->(d:Destino)\n",
    "WHERE d.ciudad = 'Bariloche'\n",
    "RETURN n.nombre AS usuario\n",
    "\"\"\"\n",
    "visitaron_Bariloche = driver.session().run(query)\n",
    "print(\"Visitaron Bariloche:\")\n",
    "for u in visitaron_Bariloche:\n",
    "    print(u['usuario'])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0d11339e",
   "metadata": {},
   "source": [
    "#### b. Amigos de 'Juan' que visitaron algún destino que Juan también visitó."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "5457b100",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\"Preguntar si es sobre algún Juan en específico, o se debe buscar sobre todos los usuarios con nombre 'Juan'\""
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\"\"\"Preguntar si es sobre algún Juan en específico, o se debe buscar sobre todos los usuarios con nombre 'Juan'\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "id": "84b85d8f",
   "metadata": {},
   "source": [
    "#### c. Sugerir destinos a un usuario que no haya visitado él ni sus amigos."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "74dcb481",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{1, 3, 4, 8, 10, 11}\n"
     ]
    }
   ],
   "source": [
    "usuario_id = 8 # lo puse así por si había que configurarlo con un imput o algo por el estilo\n",
    "usuario_id = 8 # lo puse así por si había que configurarlo con un imput o algo por el estilo\n",
    "query_destinos = f\"\"\"\n",
    "MATCH (u1:Usuario)-[:AMIGO_DE]->(u2:Usuario)\n",
    "MATCH (u2)-[:VISITO]->(d:Destino)\n",
    "WHERE u1.usuario_id = {usuario_id}\n",
    "RETURN d.destino_id AS destino\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "f564dc79-97d4-4789-9a6e-f205e7aa6c26",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Sé el primero de tus amigos en descubrir estas ciudades!\n",
      "Jujuy\n",
      "Salta\n",
      "Tucumán\n"
     ]
    }
   ],
   "source": [
    "usuario_id = 8 # intenté ingresarlo por variable con f-string, pero las {} de la consulta me lo impiden\n",
    "query_destinos = \"\"\"\n",
    "MATCH (d:Destino)\n",
    "WHERE NOT EXISTS {\n",
    "    MATCH (u1:Usuario)-[:AMIGO_DE]->(u2:Usuario)\n",
    "    MATCH (u2)-[:VISITO]->(d:Destino)\n",
    "    WHERE u1.usuario_id = 8\n",
    "} AND NOT EXISTS {\n",
    "    MATCH (u:Usuario)-[:VISITO]->(d:Destino)\n",
    "    WHERE u.usuario_id = 8\n",
    "}\n",
    "RETURN d.ciudad AS destinos\n",
    "\"\"\"\n",
    "destinos_usuarios = driver.session().run(query_destinos)\n",
    "print(\"Sé el primero de tus amigos en descubrir estas ciudades!\")\n",
    "for d in destinos_usuarios:\n",
    "    print(d['destinos'])\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "67a2a410",
   "metadata": {},
   "source": [
    "#### m-i. Destino más visitado."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "6cedb4c9-81ee-4df7-8135-c2273d9beb29",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Destino más visitado:\n",
      "Destino: Bariloche, Cantidad de visitas: 5\n",
      "Destino: Cancún, Cantidad de visitas: 5\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (n)-[:VISITO]->(d:Destino)\n",
    "RETURN d.ciudad AS destino, COUNT(n) AS cantidad\n",
    "\"\"\"\n",
    "visitas_por_destino = driver.session().run(query)\n",
    "print(\"Destino más visitado:\")\n",
    "max = 0\n",
    "list = []\n",
    "for d in visitas_por_destino:\n",
    "    if d['cantidad'] > max:\n",
    "        max = d['cantidad']\n",
    "        list = [(d['destino'], d['cantidad'])]\n",
    "    elif d['cantidad'] == max:\n",
    "        list.append((d['destino'], d['cantidad']))\n",
    "for dest in list:\n",
    "    print(f\"Destino: {dest[0]}, Cantidad de visitas: {dest[1]}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "bd805983-c4ef-431e-85be-305807a2f038",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "bd487e5d-251d-4c4b-85a6-fdc129f71163",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.14"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
