{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "bd0bdefa-e3fc-4147-92c9-115327142a5f",
   "metadata": {},
   "source": [
    "# Trabajo Integrador Base de Datos 2025"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d49ccc27-bd68-4b98-acfc-b6bb400b450c",
   "metadata": {},
   "source": [
    "## Cargamos MongoDB, Redis y Neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "6870a9cb-5bb9-4139-aebf-3c7e24eae9fc",
   "metadata": {},
   "outputs": [],
   "source": [
    "from pymongo import MongoClient\n",
    "client = MongoClient(\"mongodb://admin:admin123@mongo:27017/\")\n",
    "db = client[\"data\"]\n",
    "\n",
    "from neo4j import GraphDatabase\n",
    "driver = GraphDatabase.driver(\"bolt://neo4j:7687\",\n",
    "auth=(\"neo4j\", \"neo4j123\"))\n",
    "\n",
    "import redis\n",
    "r = redis.Redis(host=\"redis\", port=6379, password=\"redis123\",\n",
    "decode_responses=True)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6efda1dc-9abd-45b6-bf54-cb107438d805",
   "metadata": {},
   "source": [
    "<br>"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0843c794-64cd-4334-b3a1-951532d6973b",
   "metadata": {},
   "source": [
    "## 1. Carga de datos inicial"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5237e0f3-8277-464a-a3dc-8a4cf91765a1",
   "metadata": {},
   "source": [
    "### Carga de datos en MongoDB"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a9156bea-9750-4ce0-8e13-7b541e972451",
   "metadata": {},
   "source": [
    "#### a. Carga de usuarios"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "5a8ea040-f2f1-4d4d-9b67-76cac6fa7063",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "InsertManyResult([ObjectId('6901831b48da95f65c28560e'), ObjectId('6901831b48da95f65c28560f'), ObjectId('6901831b48da95f65c285610'), ObjectId('6901831b48da95f65c285611'), ObjectId('6901831b48da95f65c285612'), ObjectId('6901831b48da95f65c285613'), ObjectId('6901831b48da95f65c285614'), ObjectId('6901831b48da95f65c285615'), ObjectId('6901831b48da95f65c285616'), ObjectId('6901831b48da95f65c285617'), ObjectId('6901831b48da95f65c285618'), ObjectId('6901831b48da95f65c285619'), ObjectId('6901831b48da95f65c28561a'), ObjectId('6901831b48da95f65c28561b')], acknowledged=True)"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "usuarios = [\n",
    "{\"usuario_id\": 1, \"nombre\": \"María Pérez\", \"email\": \"maria.perez@gmail.com\", \"telefono\": \"+54 11 4567 1234\"},\n",
    "{\"usuario_id\": 2, \"nombre\": \"Juan López\", \"email\": \"juan.lopez@yahoo.com\", \"telefono\": \"+54 221 334 5566\"},\n",
    "{\"usuario_id\": 3, \"nombre\": \"Carla Gómez\", \"email\": \"carla.gomez@hotmail.com\", \"telefono\": \"+54 261 789 2233\"},\n",
    "{\"usuario_id\": 4, \"nombre\": \"Luis Fernández\", \"email\": \"luis.fernandez@hotmail.com\", \"telefono\": \"+54 299 444 9988\"},\n",
    "{\"usuario_id\": 5, \"nombre\": \"Ana Torres\", \"email\": \"ana.torres@gmail.com\", \"telefono\": \"+54 381 123 4567\"},\n",
    "{\"usuario_id\": 6, \"nombre\": \"Facundo López\", \"email\": \"facundo.lopez@gmail.com\", \"telefono\": \"+54 221 597 0204\"},\n",
    "{\"usuario_id\": 7, \"nombre\": \"Hernán López\", \"email\": \"hernan.lopez@gmail.com\", \"telefono\": \"+54 221 456 7832\"},\n",
    "{\"usuario_id\": 8, \"nombre\": \"Emilio Cerrate\", \"email\": \"emicerrate@hotmail.com\", \"telefono\": \"+54 221 321 5897\"},\n",
    "{\"usuario_id\": 9, \"nombre\": \"Juan Pablo Moreno\", \"email\": \"morenojuanpa@yahoo.com\", \"telefono\": \"+54 11 4178 2885\"},\n",
    "{\"usuario_id\": 10, \"nombre\": \"Pilar Agustina Basso\", \"email\": \"bassopilar@hotmail.com\", \"telefono\": \"+54 381 983 6623\"},\n",
    "{\"usuario_id\": 11, \"nombre\": \"Guido Marcelo Carrillo\", \"email\": \"guidocarrillo@gmail.com\", \"telefono\": \"+54 221 445 5696\"},\n",
    "{\"usuario_id\": 12, \"nombre\": \"Franco Urricelqui\", \"email\": \"franco.urricelqui@gmail.com\", \"telefono\": \"+54 221 348 1144\"},\n",
    "{\"usuario_id\": 13, \"nombre\": \"Jalen Brunson\", \"email\": \"jalenbrunson@hotmail.com\", \"telefono\": \"+1 212 6332 7888\"},\n",
    "{\"usuario_id\": 14, \"nombre\": \"Josh Hart\", \"email\": \"hart.josh@gmail.com\", \"telefono\": \"+1 212 8445 5236\"}\n",
    "]\n",
    "\n",
    "db.usuarios.insert_many(usuarios)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e62a1a89-5173-4053-af5f-5069ecef7684",
   "metadata": {},
   "source": [
    "#### b. Carga de destinos"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "bb9cea74-0cfe-4fa3-9b7e-611fa14896d9",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "InsertManyResult([ObjectId('6901831c48da95f65c28561c'), ObjectId('6901831c48da95f65c28561d'), ObjectId('6901831c48da95f65c28561e'), ObjectId('6901831c48da95f65c28561f'), ObjectId('6901831c48da95f65c285620'), ObjectId('6901831c48da95f65c285621'), ObjectId('6901831c48da95f65c285622'), ObjectId('6901831c48da95f65c285623'), ObjectId('6901831c48da95f65c285624'), ObjectId('6901831c48da95f65c285625'), ObjectId('6901831c48da95f65c285626'), ObjectId('6901831c48da95f65c285627')], acknowledged=True)"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "destinos = [\n",
    "{\"destino_id\": 1, \"ciudad\": \"Bariloche\", \"pais\": \"Argentina\", \"tipo\": \"Montaña\", \"precio_promedio\": 102500},\n",
    "{\"destino_id\": 2, \"ciudad\": \"Cancún\", \"pais\": \"México\", \"tipo\": \"Playa\", \"precio_promedio\": 150000},\n",
    "{\"destino_id\": 3, \"ciudad\": \"Madrid\", \"pais\": \"España\", \"tipo\": \"Cultural\", \"precio_promedio\": 125000},\n",
    "{\"destino_id\": 4, \"ciudad\": \"Roma\", \"pais\": \"Italia\", \"tipo\": \"Histórico\", \"precio_promedio\": 100000},\n",
    "{\"destino_id\": 5, \"ciudad\": \"Mendoza\", \"pais\": \"Argentina\", \"tipo\": \"Vinos\", \"precio_promedio\": 85000},\n",
    "{\"destino_id\": 6, \"ciudad\": \"Jujuy\", \"pais\": \"Argentina\", \"tipo\": \"Montaña\", \"precio_promedio\": 60000},\n",
    "{\"destino_id\": 7, \"ciudad\": \"Córdoba\", \"pais\": \"Argentina\", \"tipo\": \"Cultural\", \"precio_promedio\": 70000},\n",
    "{\"destino_id\": 8, \"ciudad\": \"París\", \"pais\": \"Francia\", \"tipo\": \"Cultural\", \"precio_promedio\": 110000},\n",
    "{\"destino_id\": 9, \"ciudad\": \"Salta\", \"pais\": \"Argentina\", \"tipo\": \"Montaña\", \"precio_promedio\": 65000},\n",
    "{\"destino_id\": 10, \"ciudad\": \"Florianópolis\", \"pais\": \"Brasil\", \"tipo\": \"Playa\", \"precio_promedio\": 80000},\n",
    "{\"destino_id\": 11, \"ciudad\": \"Ushuaia\", \"pais\": \"Argentina\", \"tipo\": \"Glaciar\", \"precio_promedio\": 90000},\n",
    "{\"destino_id\": 12, \"ciudad\": \"Tucumán\", \"pais\": \"Argentina\", \"tipo\": \"Cultural\", \"precio_promedio\": 55000}\n",
    "]\n",
    "\n",
    "db.destinos.insert_many(destinos)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d66b2d89-3b09-49fb-98df-ad231de80ae1",
   "metadata": {},
   "source": [
    "#### c. Carga de hoteles"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "f7f3d0d0-697f-4b62-95cc-0eb463ad65cb",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "InsertManyResult([ObjectId('6901831e48da95f65c285628'), ObjectId('6901831e48da95f65c285629'), ObjectId('6901831e48da95f65c28562a'), ObjectId('6901831e48da95f65c28562b'), ObjectId('6901831e48da95f65c28562c'), ObjectId('6901831e48da95f65c28562d'), ObjectId('6901831e48da95f65c28562e'), ObjectId('6901831e48da95f65c28562f'), ObjectId('6901831e48da95f65c285630'), ObjectId('6901831e48da95f65c285631'), ObjectId('6901831e48da95f65c285632'), ObjectId('6901831e48da95f65c285633'), ObjectId('6901831e48da95f65c285634'), ObjectId('6901831e48da95f65c285635'), ObjectId('6901831e48da95f65c285636')], acknowledged=True)"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "hoteles = [\n",
    "{\"hotel_id\": 1, \"nombre\": \"Hotel Sol\", \"ciudad\": \"Bariloche\", \"precio\": 85000, \"calificacion\": 4, \"servicios\": [\"wifi\", \"pileta\", \"desayuno\"]},\n",
    "{\"hotel_id\": 2, \"nombre\": \"Cumbres Andinas\", \"ciudad\": \"Bariloche\", \"precio\": 120000, \"calificacion\": 5, \"servicios\": [\"wifi\", \"spa\", \"pileta\"]},\n",
    "{\"hotel_id\": 3, \"nombre\": \"Altos del Norte\", \"ciudad\": \"Jujuy\", \"precio\": 60000, \"calificacion\": 3, \"servicios\": [\"wifi\"]},\n",
    "{\"hotel_id\": 4, \"nombre\": \"Montaña Real\", \"ciudad\": \"Mendoza\", \"precio\": 85000, \"calificacion\": 4, \"servicios\": [\"wifi\", \"pileta\"]},\n",
    "{\"hotel_id\": 5, \"nombre\": \"Estancia Colonial\", \"ciudad\": \"Córdoba\", \"precio\": 70000, \"calificacion\": 4, \"servicios\": [\"wifi\", \"desayuno\"]},\n",
    "{\"hotel_id\": 6, \"nombre\": \"Royal Caribbean\", \"ciudad\": \"Cancún\", \"precio\": 150000, \"calificacion\": 5, \"servicios\": [\"wifi\", \"desayuno\", \"pileta\", \"gimnasio\"]},\n",
    "{\"hotel_id\": 7, \"nombre\": \"Mandarin Oriental Ritz\", \"ciudad\": \"Madrid\", \"precio\": 180000, \"calificacion\": 5, \"servicios\": [\"wifi\", \"desayuno\", \"pileta\", \"gimnasio\"]},\n",
    "{\"hotel_id\": 8, \"nombre\": \"Casa du Soleil\", \"ciudad\": \"Madrid\", \"precio\": 70000, \"calificacion\": 3, \"servicios\": [\"wifi\"]},\n",
    "{\"hotel_id\": 9, \"nombre\": \"Sei Sensi\", \"ciudad\": \"Roma\", \"precio\": 100000, \"calificacion\": 4, \"servicios\": [\"wifi\", \"desayuno\"]},\n",
    "{\"hotel_id\": 10, \"nombre\": \"Étudiants\", \"ciudad\": \"París\", \"precio\": 150000, \"calificacion\": 5, \"servicios\": [\"wifi\", \"desayuno\", \"pileta\", \"gimnasio\"]},\n",
    "{\"hotel_id\": 11, \"nombre\": \"Escrime\", \"ciudad\": \"París\", \"precio\": 70000, \"calificacion\": 3, \"servicios\": [\"wifi\"]},\n",
    "{\"hotel_id\": 12, \"nombre\": \"Gran Montaña\", \"ciudad\": \"Salta\", \"precio\": 65000, \"calificacion\": 4, \"servicios\": [\"wifi\", \"desayuno\"]},\n",
    "{\"hotel_id\": 13, \"nombre\": \"Foda Louca\", \"ciudad\": \"Florianópolis\", \"precio\": 80000, \"calificacion\": 4, \"servicios\": [\"wifi\", \"desayuno\", \"pileta\", \"gimnasio\"]},\n",
    "{\"hotel_id\": 14, \"nombre\": \"Alto Andino\", \"ciudad\": \"Ushuaia\", \"precio\": 90000, \"calificacion\": 4, \"servicios\": [\"wifi\", \"desayuno\"]},\n",
    "{\"hotel_id\": 15, \"nombre\": \"Gran Maestro\", \"ciudad\": \"Tucumán\", \"precio\": 55000, \"calificacion\": 3, \"servicios\": [\"wifi\"]}\n",
    "]\n",
    "\n",
    "db.hoteles.insert_many(hoteles)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "61b95136-d03c-42d2-a3ab-a1af2abdf948",
   "metadata": {},
   "source": [
    "#### d. Carga de actividades"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "140180ae-a501-4374-9823-dc78c2655c53",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "InsertManyResult([ObjectId('6901831f48da95f65c285637'), ObjectId('6901831f48da95f65c285638'), ObjectId('6901831f48da95f65c285639'), ObjectId('6901831f48da95f65c28563a'), ObjectId('6901831f48da95f65c28563b'), ObjectId('6901831f48da95f65c28563c'), ObjectId('6901831f48da95f65c28563d'), ObjectId('6901831f48da95f65c28563e'), ObjectId('6901831f48da95f65c28563f'), ObjectId('6901831f48da95f65c285640'), ObjectId('6901831f48da95f65c285641'), ObjectId('6901831f48da95f65c285642'), ObjectId('6901831f48da95f65c285643'), ObjectId('6901831f48da95f65c285644'), ObjectId('6901831f48da95f65c285645'), ObjectId('6901831f48da95f65c285646'), ObjectId('6901831f48da95f65c285647')], acknowledged=True)"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "actividades = [\n",
    "{\"actividad_id\": 1, \"nombre\": \"Caminata en glaciares\", \"tipo\": \"aventura\", \"ciudad\": \"Bariloche\", \"precio\": 45000},\n",
    "{\"actividad_id\": 2, \"nombre\": \"Degustación de vinos\", \"tipo\": \"cultura\", \"ciudad\": \"Mendoza\", \"precio\": 30000},\n",
    "{\"actividad_id\": 3, \"nombre\": \"Tour por cerros\", \"tipo\": \"aventura\", \"ciudad\": \"Jujuy\", \"precio\": 25000},\n",
    "{\"actividad_id\": 4, \"nombre\": \"Recorrido histórico\", \"tipo\": \"cultura\", \"ciudad\": \"Córdoba\", \"precio\": 20000},\n",
    "{\"actividad_id\": 5, \"nombre\": \"Excursión en 4x4\", \"tipo\": \"aventura\", \"ciudad\": \"Salta\", \"precio\": 55000},\n",
    "{\"actividad_id\": 6, \"nombre\": \"Tirolesa en las montañas\", \"tipo\": \"aventura\", \"ciudad\": \"Bariloche\", \"precio\": 45000},\n",
    "{\"actividad_id\": 7, \"nombre\": \"Snorkel en arrecifes\", \"tipo\": \"aventura\", \"ciudad\": \"Cancún\", \"precio\": 68000},\n",
    "{\"actividad_id\": 8, \"nombre\": \"Visita al Coliseo\", \"tipo\": \"historia\", \"ciudad\": \"Roma\", \"precio\": 85000},\n",
    "{\"actividad_id\": 9, \"nombre\": \"Tour gastronómico por Trastevere\", \"tipo\": \"cultura\", \"ciudad\": \"Roma\", \"precio\": 65000},\n",
    "{\"actividad_id\": 10, \"nombre\": \"Tour por el Louvre\", \"tipo\": \"cultura\", \"ciudad\": \"París\", \"precio\": 120000},\n",
    "{\"actividad_id\": 11, \"nombre\": \"Crucero por el Sena\", \"tipo\": \"relax\", \"ciudad\": \"París\", \"precio\": 45000},\n",
    "{\"actividad_id\": 12, \"nombre\": \"Tour por el Museo del Prado\", \"tipo\": \"cultura\", \"ciudad\": \"Madrid\", \"precio\": 100000},\n",
    "{\"actividad_id\": 13, \"nombre\": \"Visita al Palacio Real\", \"tipo\": \"historia\", \"ciudad\": \"Madrid\", \"precio\": 70000},\n",
    "{\"actividad_id\": 14, \"nombre\": \"Paseo en buggy por las dunas\", \"tipo\": \"aventura\", \"ciudad\": \"Florianópolis\", \"precio\": 45000},\n",
    "{\"actividad_id\": 15, \"nombre\": \"Visita a las Ruinas de Quilmes\", \"tipo\": \"cultura\", \"ciudad\": \"Tucumán\", \"precio\": 25000},\n",
    "{\"actividad_id\": 16, \"nombre\": \"Navegación por el Canal Beagle\", \"tipo\": \"aventura\", \"ciudad\": \"Ushuaia\", \"precio\": 60000},\n",
    "{\"actividad_id\": 17, \"nombre\": \"Excursión al Parque Nacional Tierra del Fuego\", \"tipo\": \"naturaleza\", \"ciudad\": \"Ushuaia\", \"precio\": 55000}\n",
    "]\n",
    "\n",
    "db.actividades.insert_many(actividades)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3308c5b1-4d27-4252-a8d4-bdb7c1121852",
   "metadata": {},
   "source": [
    "#### e. Carga de reservas"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "5e245eda-5feb-435e-9f6b-55507f5d6e24",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "InsertManyResult([ObjectId('6901832048da95f65c285648'), ObjectId('6901832048da95f65c285649'), ObjectId('6901832048da95f65c28564a'), ObjectId('6901832048da95f65c28564b'), ObjectId('6901832048da95f65c28564c'), ObjectId('6901832048da95f65c28564d'), ObjectId('6901832048da95f65c28564e'), ObjectId('6901832048da95f65c28564f'), ObjectId('6901832048da95f65c285650'), ObjectId('6901832048da95f65c285651'), ObjectId('6901832048da95f65c285652'), ObjectId('6901832048da95f65c285653'), ObjectId('6901832048da95f65c285654'), ObjectId('6901832048da95f65c285655'), ObjectId('6901832048da95f65c285656'), ObjectId('6901832048da95f65c285657'), ObjectId('6901832048da95f65c285658')], acknowledged=True)"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "reservas = [\n",
    "{\"reserva_id\": 1, \"usuario_id\": 1, \"destino_id\": 2, \"fecha_reserva\": \"2025-07-01\", \"estado\": \"Confirmada\", \"precio_total\": 218000, \"paquete\": {\"paquete_id\": 15, \"hotel\": 6, \"duración estadía\": 7, \"actividades_incluidas\": [7]}},\n",
    "{\"reserva_id\": 2, \"usuario_id\": 2, \"destino_id\": 1, \"fecha_reserva\": \"2025-06-15\", \"estado\": \"Pagada\", \"precio_total\": 165000, \"paquete\": {\"paquete_id\": 2, \"hotel\": 1, \"duración estadía\": 7, \"actividades_incluidas\": [6]}},\n",
    "{\"reserva_id\": 3, \"usuario_id\": 3, \"destino_id\": 3, \"fecha_reserva\": \"2025-05-20\", \"estado\": \"Cancelada\", \"precio_total\": 125000, \"paquete\": {\"paquete_id\": 13, \"hotel\": 7, \"duración estadía\": 7, \"actividades_incluidas\": [12, 13]}},\n",
    "{\"reserva_id\": 4, \"usuario_id\": 1, \"destino_id\": 4, \"fecha_reserva\": \"2025-07-10\", \"estado\": \"Pendiente\", \"precio_total\": 100000, \"paquete\": {\"paquete_id\": 10, \"hotel\": 9, \"duración estadía\": 3, \"actividades_incluidas\": [8]}},\n",
    "{\"reserva_id\": 5, \"usuario_id\": 5, \"destino_id\": 5, \"fecha_reserva\": \"2025-06-25\", \"estado\": \"Confirmada\", \"precio_total\": 115000, \"paquete\": {\"paquete_id\": 2, \"hotel\": 1, \"duración estadía\": 7, \"actividades_incluidas\": [6]}},\n",
    "{\"reserva_id\": 6, \"usuario_id\": 10, \"destino_id\": 10, \"fecha_reserva\": \"2025-07-30\", \"estado\": \"Pendiente\", \"precio_total\": 80000},\n",
    "{\"reserva_id\": 7, \"usuario_id\": 14, \"destino_id\": 7, \"fecha_reserva\": \"2025-08-20\", \"estado\": \"Pendiente\", \"precio_total\": 70000},\n",
    "{\"reserva_id\": 8, \"usuario_id\": 7, \"destino_id\": 8, \"fecha_reserva\": \"2025-08-02\", \"estado\": \"Confirmada\", \"precio_total\": 270000, \"paquete\": {\"paquete_id\": 11, \"hotel\": 11, \"duración estadía\": 3, \"actividades_incluidas\": [10]}},\n",
    "{\"reserva_id\": 9, \"usuario_id\": 12, \"destino_id\": 2, \"fecha_reserva\": \"2025-09-11\", \"estado\": \"Pagada\", \"precio_total\": 218000, \"paquete\": {\"paquete_id\": 15, \"hotel\": 6, \"duración estadía\": 7, \"actividades_incluidas\": [7]}},\n",
    "{\"reserva_id\": 10, \"usuario_id\": 3, \"destino_id\": 3, \"fecha_reserva\": \"2025-09-03\", \"estado\": \"Pagada\", \"precio_total\": 180000, \"paquete\": {\"paquete_id\": 14, \"hotel\": 7, \"duración estadía\": 10, \"actividades_incluidas\": [12, 13]}},\n",
    "{\"reserva_id\": 11, \"usuario_id\": 7, \"destino_id\": 9, \"fecha_reserva\": \"2025-06-14\", \"estado\": \"Confirmada\", \"precio_total\": 65000},\n",
    "{\"reserva_id\": 12, \"usuario_id\": 9, \"destino_id\": 4, \"fecha_reserva\": \"2025-05-25\", \"estado\": \"Confirmada\", \"precio_total\": 185000, \"paquete\": {\"paquete_id\": 9, \"hotel\": 9, \"duración estadía\": 5, \"actividades_incluidas\": [8, 9]}},\n",
    "{\"reserva_id\": 13, \"usuario_id\": 12, \"destino_id\": 6, \"fecha_reserva\": \"2025-12-12\", \"estado\": \"Pendiente\", \"precio_total\": 85000},\n",
    "{\"reserva_id\": 14, \"usuario_id\": 8, \"destino_id\": 6, \"fecha_reserva\": \"2025-12-09\", \"estado\": \"Confirmada\", \"precio_total\": 60000, \"paquete\": {\"paquete_id\": 15, \"hotel\": 6, \"duración estadía\": 7, \"actividades_incluidas\": [7]}},\n",
    "{\"reserva_id\": 15, \"usuario_id\": 2, \"destino_id\": 10, \"fecha_reserva\": \"2025-12-18\", \"estado\": \"Pendiente\", \"precio_total\": 125000},\n",
    "{\"reserva_id\": 16, \"usuario_id\": 5, \"destino_id\": 11, \"fecha_reserva\": \"2025-03-17\", \"estado\": \"Pagada\", \"precio_total\": 145000, \"paquete\": {\"paquete_id\": 6, \"hotel\": 14, \"duración estadía\": 10, \"actividades_incluidas\": [16, 17]}},\n",
    "{\"reserva_id\": 17, \"usuario_id\": 4, \"destino_id\": 12, \"fecha_reserva\": \"2025-04-28\", \"estado\": \"Cancelada\", \"precio_total\": 90000}\n",
    "]\n",
    "\n",
    "db.reservas.insert_many(reservas)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1eea23e5-0d03-4907-b721-24d90bdaa1ce",
   "metadata": {},
   "source": [
    "<br>"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "25da6759-7a0e-40c5-88ad-ecabf7e199a8",
   "metadata": {},
   "source": [
    "### Carga de datos en Neo4j"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "618b2ed1-a23c-42a1-9d8a-646cca1d2a98",
   "metadata": {},
   "source": [
    "#### a. Carga de usuarios\n",
    "#### b. Carga de destinos\n",
    "#### i. Carga de relaciones entre usuarios y destinos\n",
    "#### j. Carga de relaciones entre usuarios y usuarios"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "891bfda3-b972-43e1-91a5-5c259c10baec",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j._sync.work.result.Result at 0x78e4a27566d0>"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query= \"\"\"MERGE (m:Usuario {usuario_id:1, nombre:'María Pérez'})\n",
    "MERGE (jl:Usuario {usuario_id:2, nombre:'Juan López'})\n",
    "MERGE (c:Usuario {usuario_id:3, nombre:'Carla Gómez'})\n",
    "MERGE (l:Usuario {usuario_id:4, nombre:'Luis Fernández'})\n",
    "MERGE (a:Usuario {usuario_id:5, nombre:'Ana Torres'})\n",
    "MERGE (fl:Usuario {usuario_id:6, nombre:'Facundo López'})\n",
    "MERGE (h:Usuario {usuario_id:7, nombre:'Hernán López'})\n",
    "MERGE (e:Usuario {usuario_id:8, nombre:'Emilio Cerrate'})\n",
    "MERGE (jp:Usuario {usuario_id:9, nombre:'Juan Pablo Moreno'})\n",
    "MERGE (p:Usuario {usuario_id:10, nombre:'Pilar Agustina Basso'})\n",
    "MERGE (g:Usuario {usuario_id:11, nombre:'Guido Marcelo Carrillo'})\n",
    "MERGE (fu:Usuario {usuario_id:12, nombre:'Franco Urricelqui'})\n",
    "MERGE (jb:Usuario {usuario_id:13, nombre:'Jalen Brunson'})\n",
    "MERGE (jh:Usuario {usuario_id:14, nombre:'Josh Hart'})\n",
    "\n",
    "MERGE (d1:Destino {destino_id:1, ciudad:'Bariloche', pais:'Argentina'})\n",
    "MERGE (d2:Destino {destino_id:2, ciudad:'Cancún', pais:'México'})\n",
    "MERGE (d3:Destino {destino_id:3, ciudad:'Madrid', pais:'España'})\n",
    "MERGE (d4:Destino {destino_id:4, ciudad:'Roma', pais:'Italia'})\n",
    "MERGE (d5:Destino {destino_id:5, ciudad:'Mendoza', pais:'Argentina'})\n",
    "MERGE (d6:Destino {destino_id:6, ciudad:'Jujuy', pais:'Argentina'})\n",
    "MERGE (d7:Destino {destino_id:7, ciudad:'Córdoba', pais:'Argentina'})\n",
    "MERGE (d8:Destino {destino_id:8, ciudad:'París', pais:'Francia'})\n",
    "MERGE (d9:Destino {destino_id:9, ciudad:'Salta', pais:'Argentina'})\n",
    "MERGE (d10:Destino {destino_id:10, ciudad:'Florianópolis', pais:'Brasil'})\n",
    "MERGE (d11:Destino {destino_id:11, ciudad:'Ushuaia', pais:'Argentina'})\n",
    "MERGE (d12:Destino {destino_id:12, ciudad:'Tucumán', pais:'Argentina'})\n",
    "\n",
    "MERGE (m)-[:VISITO]->(d1)\n",
    "MERGE (m)-[:VISITO]->(d5)\n",
    "MERGE (jl)-[:VISITO]->(d1)\n",
    "MERGE (c)-[:VISITO]->(d3)\n",
    "MERGE (l)-[:VISITO]->(d2)\n",
    "MERGE (a)-[:VISITO]->(d1)\n",
    "MERGE (a)-[:VISITO]->(d4)\n",
    "MERGE (e)-[:VISITO]->(d2)\n",
    "MERGE (e)-[:VISITO]->(d1)\n",
    "MERGE (e)-[:VISITO]->(d5)\n",
    "MERGE (e)-[:VISITO]->(d7)\n",
    "MERGE (fu)-[:VISITO]->(d1)\n",
    "MERGE (fu)-[:VISITO]->(d3)\n",
    "MERGE (fu)-[:VISITO]->(d4)\n",
    "MERGE (fu)-[:VISITO]->(d8)\n",
    "MERGE (fu)-[:VISITO]->(d11)\n",
    "MERGE (jb)-[:VISITO]->(d2)\n",
    "MERGE (jb)-[:VISITO]->(d8)\n",
    "MERGE (jh)-[:VISITO]->(d2)\n",
    "MERGE (jh)-[:VISITO]->(d8)\n",
    "MERGE (fl)-[:VISITO]->(d10)\n",
    "MERGE (h)-[:VISITO]->(d10)\n",
    "MERGE (g)-[:VISITO]->(d6)\n",
    "MERGE (g)-[:VISITO]->(d12)\n",
    "MERGE (jp)-[:VISITO]->(d10)\n",
    "MERGE (a)-[:VISITO]->(d7)\n",
    "MERGE (g)-[:VISITO]->(d8)\n",
    "MERGE (jl)-[:VISITO]->(d5)\n",
    "MERGE (jp)-[:VISITO]->(d5)\n",
    "\n",
    "MERGE (m)-[:AMIGO_DE]->(jl)\n",
    "MERGE (jl)-[:AMIGO_DE]->(m)\n",
    "MERGE (c)-[:FAMILIAR_DE]->(l)\n",
    "MERGE (l)-[:FAMILIAR_DE]->(c)\n",
    "MERGE (a)-[:AMIGO_DE]->(l)\n",
    "MERGE (jl)-[:FAMILIAR_DE]->(fl)\n",
    "MERGE (fl)-[:FAMILIAR_DE]->(jl)\n",
    "MERGE (h)-[:FAMILIAR_DE]->(jl)\n",
    "MERGE (jl)-[:FAMILIAR_DE]->(h)\n",
    "MERGE (h)-[:FAMILIAR_DE]->(fl)\n",
    "MERGE (fl)-[:FAMILIAR_DE]->(h)\n",
    "MERGE (fu)-[:AMIGO_DE]->(e)\n",
    "MERGE (e)-[:AMIGO_DE]->(fu)\n",
    "MERGE (e)-[:AMIGO_DE]->(jp)\n",
    "MERGE (jp)-[:AMIGO_DE]->(e)\n",
    "MERGE (fu)-[:PAREJA_DE]->(c)\n",
    "MERGE (c)-[:PAREJA_DE]->(fu)\n",
    "MERGE (e)-[:PAREJA_DE]->(p)\n",
    "MERGE (p)-[:PAREJA_DE]->(e)\n",
    "MERGE (jb)-[:AMIGO_DE]->(jh)\n",
    "MERGE (jh)-[:AMIGO_DE]->(jb)\n",
    "MERGE (a)-[:AMIGO_DE]->(p)\n",
    "MERGE (p)-[:AMIGO_DE]->(a)\n",
    "MERGE (g)-[:AMIGO_DE]->(l)\n",
    "MERGE (jl)-[:AMIGO_DE]->(jp)\n",
    "MERGE (jp)-[:AMIGO_DE]->(jl)\n",
    "\"\"\"\n",
    "driver.session().run(query)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "78eee824-ce91-4fd9-a803-7e8437ffa7c4",
   "metadata": {},
   "source": [
    "<br>"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "dc19140f-cbb7-4f4f-b306-6ddae5e8e158",
   "metadata": {},
   "source": [
    "### Carga de datos en Redis"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7475de18-e0f1-4412-a211-f35549477b95",
   "metadata": {},
   "source": [
    "#### f. Caché de búsquedas"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "d3d5a020-ded7-4928-aa27-d051812a6c4b",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Se cargan a medida que se hacen las búsquedas"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8070d8af-3a53-4713-8f3b-4088de2c213f",
   "metadata": {},
   "source": [
    "#### g. Usuarios conectados"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "aea56428-5b0c-4add-95bd-f403616e0a5e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "r.set(\"sesion:usuario:2\", \"activa\", ex=600)\n",
    "r.set(\"sesion:usuario:4\", \"activa\", ex=300)\n",
    "r.set(\"sesion:usuario:5\", \"activa\", ex=1200)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c07a99f4-6066-44f1-8b46-9850da45fb5a",
   "metadata": {},
   "source": [
    "#### h. Reservas temporales"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "fd85455e-2cde-4f48-a979-9b900e2cba7f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "3"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "r.hset(\"reserva:18\", mapping={\"id_usuario\": \"2\", \"destino_id\": \"5\", \"fecha_reserva\": \"17-10-2025\"})\n",
    "r.hset(\"reserva:19\", mapping={\"id_usuario\": \"5\", \"destino_id\": \"3\", \"fecha_reserva\": \"20-10-2025\"})"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "79c84ae2",
   "metadata": {},
   "source": [
    "## 2. Consultas"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e3c46366",
   "metadata": {},
   "source": [
    "#### a. Usuarios que visitaron 'Bariloche'."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "69377c39-0708-4cd3-8905-0f3361104046",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Visitaron Bariloche:\n",
      "Franco Urricelqui\n",
      "Emilio Cerrate\n",
      "Ana Torres\n",
      "Juan López\n",
      "María Pérez\n"
     ]
    }
   ],
   "source": [
    "print(\"Visitaron Bariloche:\")\n",
    "if (\"busqueda:usuarios:bariloche\" not in r.keys(\"busqueda:usuarios:*\")):\n",
    "    query = \"\"\"\n",
    "    MATCH (n)-[:VISITO]->(d:Destino)\n",
    "    WHERE d.ciudad = 'Bariloche'\n",
    "    RETURN n.nombre AS usuario\n",
    "    \"\"\"\n",
    "    visitaron_Bariloche = driver.session().run(query)\n",
    "    for u in visitaron_Bariloche:\n",
    "        print(u['usuario'])\n",
    "        r.rpush(\"busqueda:usuarios:bariloche\", u[\"usuario\"])\n",
    "else:\n",
    "    for u in r.lrange(\"busqueda:usuarios:bariloche\", 0, -1):\n",
    "        print(u)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0d11339e",
   "metadata": {},
   "source": [
    "#### b. Amigos de 'Juan' que visitaron algún destino que Juan también visitó."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "5457b100",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Juan comparte destinos con estos amigos:\n",
      "Juan Pablo Moreno viajó a Mendoza\n",
      "María Pérez viajó a Mendoza\n",
      "María Pérez viajó a Bariloche\n"
     ]
    }
   ],
   "source": [
    "print(\"Juan comparte destinos con estos amigos:\")\n",
    "if (\"busqueda:usuarios:amigos:juan:destinos\" not in r.keys(\"busqueda:usuarios:*\")):\n",
    "    query_amigos = \"\"\"\n",
    "    MATCH (u1:Usuario)-[:AMIGO_DE]->(u2:Usuario)-[:VISITO]->(d:Destino)\n",
    "    WHERE EXISTS {\n",
    "        MATCH (u1)-[:VISITO]->(d)\n",
    "    } AND u1.nombre = \"Juan López\"\n",
    "    RETURN u2.nombre AS amigo, d.ciudad AS destino\n",
    "    \"\"\"\n",
    "    amigos_Juan = driver.session().run(query_amigos)\n",
    "    for a in amigos_Juan:\n",
    "        print(f\"{a['amigo']} viajó a {a['destino']}\")\n",
    "        r.rpush(\"busqueda:usuarios:amigos:juan:destinos\", f\"{a['amigo']} viajó a {a['destino']}\")\n",
    "else:\n",
    "    for a in r.lrange(\"busqueda:usuarios:amigos:juan:destinos\", 0, -1):\n",
    "        print(a)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "84b85d8f",
   "metadata": {},
   "source": [
    "#### c. Sugerir destinos a un usuario que no haya visitado él ni sus amigos."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "f564dc79-97d4-4789-9a6e-f205e7aa6c26",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "¡Emilio sé el primero de tus amigos en descubrir estas ciudades!\n",
      "Jujuy\n",
      "Salta\n",
      "Tucumán\n"
     ]
    }
   ],
   "source": [
    "print(\"¡Emilio sé el primero de tus amigos en descubrir estas ciudades!\")\n",
    "usuario_id = 8 # intenté ingresarlo por variable con f-string, pero las {} de la consulta me lo impiden\n",
    "if (\"busqueda:destinos:8:no:visito\" not in r.keys(\"busqueda:destinos:*\")):\n",
    "    query_destinos = \"\"\"\n",
    "    MATCH (d:Destino)\n",
    "    WHERE NOT EXISTS {\n",
    "        MATCH (u1:Usuario)-[:AMIGO_DE]->(u2:Usuario)\n",
    "        MATCH (u2)-[:VISITO]->(d:Destino)\n",
    "        WHERE u1.usuario_id = 8\n",
    "    } AND NOT EXISTS {\n",
    "        MATCH (u:Usuario)-[:VISITO]->(d:Destino)\n",
    "        WHERE u.usuario_id = 8\n",
    "    }\n",
    "    RETURN d.ciudad AS destinos\n",
    "    \"\"\"\n",
    "    destinos_usuarios = driver.session().run(query_destinos)\n",
    "    for d in destinos_usuarios:\n",
    "        print(d['destinos'])\n",
    "        r.rpush(\"busqueda:destinos:8:no:visito\", d['destinos'])\n",
    "else:\n",
    "    for d in r.lrange(\"busqueda:destinos:8:no:visito\", 0, -1):\n",
    "        print(d)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "de8632e5-9fc7-48a1-8603-db75e07d62c5",
   "metadata": {},
   "source": [
    "#### d. Recomendar destinos basados en viajes de amigos."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 70,
   "id": "548e9a75-3eea-435d-8e32-342be0a61203",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Tus amigos visitaron:\n",
      "Mendoza\n",
      "Bariloche\n"
     ]
    }
   ],
   "source": [
    "print(\"Tus amigos visitaron:\")\n",
    "usuario_id = 1\n",
    "if (\"busqueda:destinos:amigos:1:visitaron\" not in r.keys(\"busqueda:destinos:*\")):\n",
    "    query = f\"\"\"\n",
    "    MATCH (u1:Usuario)-[:AMIGO_DE]->(u2:Usuario)-[:VISITO]->(d:Destino)\n",
    "    WHERE u1.usuario_id = {usuario_id}\n",
    "    WITH d, u2\n",
    "        LIMIT 5\n",
    "    RETURN d.ciudad AS destino, u2.nombre AS amigo\n",
    "    \"\"\"\n",
    "    destinos_de_amigos = driver.session().run(query)\n",
    "    for d in destinos_de_amigos:\n",
    "        print(d['destino'])\n",
    "        r.rpush(\"busqueda:destinos:amigos:1:visitaron\", d['destino'])\n",
    "else:\n",
    "    for d in r.lrange(\"busqueda:destinos:amigos:1:visitaron\", 0, -1):\n",
    "        print(d)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2ebd8c0a-f4e1-4f16-85a5-cc3cd7f1ec29",
   "metadata": {},
   "source": [
    "#### e. Listar los hoteles en los destinos recomendados del punto anterior."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 78,
   "id": "c6af23df-80a4-4097-8d52-7da815292b1d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Mendoza:\n",
      "Montaña Real\n",
      "\n",
      "Bariloche:\n",
      "Hotel Sol\n",
      "Cumbres Andinas\n",
      "\n"
     ]
    }
   ],
   "source": [
    "if (\"busqueda:destinos:amigos:1:visitaron\" in r.keys(\"busqueda:destinos:*\")):\n",
    "    for d in r.lrange(\"busqueda:destinos:amigos:1:visitaron\", 0, -1):\n",
    "        print(f\"{d}:\")\n",
    "        hoteles = db.hoteles.find({\"ciudad\":d})\n",
    "        for h in hoteles:\n",
    "            print(h['nombre'])\n",
    "        print()\n",
    "else:\n",
    "    print(\"¡No se realizo el inciso anterior!\")\n",
    "\n",
    "#for d in lista_destinos:\n",
    "#    hoteles_de_destino = db.hoteles.find({\"ciudad\":d})\n",
    "#    print(d)\n",
    "#    for h in hoteles_de_destino:\n",
    "#        print(h['nombre'])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "097c7387-dc75-45b6-ad3b-97fe253354ea",
   "metadata": {},
   "source": [
    "#### f. Ver las reservas en proceso, es decir que aún no están concretadas"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "de966feb-7279-4de2-80d5-448e67aafbca",
   "metadata": {},
   "outputs": [],
   "source": [
    "reservas_temporales = r.keys('reserva:*')\n",
    "reservas_temporales.sort()\n",
    "print('Reservas en proceso:')\n",
    "for reserva in reservas_temporales:\n",
    "    print(f\"Reserva {reserva[8:]}, hecha por el usuario {r.hget(reserva, 'id_usuario')}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "dbe3428b-136e-4934-b204-8a2c1697ff22",
   "metadata": {},
   "source": [
    "#### g. Listar los usuarios conectados actualmente."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9dfeab54-8586-4bc9-80b4-2aae48433c31",
   "metadata": {},
   "outputs": [],
   "source": [
    "usuarios_conectados = r.keys('sesion:usuario:*')\n",
    "usuarios_conectados.sort()\n",
    "print(\"Usuarios conectados actualmente:\")\n",
    "for usuario in usuarios_conectados:\n",
    "    print(f\"Usuario {usuario[15:]}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "36075125-a6e3-4a02-8e17-eea504005ee7",
   "metadata": {},
   "source": [
    "#### h. Mostrar los destinos con precio inferior a $100.000."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9193a25d-adca-4ff2-9e41-00d1ccc54264",
   "metadata": {},
   "outputs": [],
   "source": [
    "print(\"Destinos con precio inferior a $100.000:\")\n",
    "if (\"busqueda:destinos:baratos\" not in r.keys(\"busqueda:destinos:*\")):\n",
    "    destinos_baratos = db.destinos.find(\n",
    "        {\"precio_promedio\": { \"$lt\": 100000 }}\n",
    "    )\n",
    "    for destino in destinos_baratos:\n",
    "        print(destino[\"ciudad\"])\n",
    "        r.rpush(\"busqueda:destinos:baratos\", destino[\"ciudad\"])\n",
    "else:\n",
    "    for destino in r.lrange(\"busqueda:destinos:baratos\", 0, -1):\n",
    "        print(destino)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "caec5fec-61b3-4b85-8ee3-85bead2d1bb9",
   "metadata": {},
   "source": [
    "#### i. Mostrar todos los Hoteles de “Jujuy”."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4a4ff68f-fe01-40be-ab6e-812de3a8f575",
   "metadata": {},
   "outputs": [],
   "source": [
    "print(\"Hoteles en Jujuy:\")\n",
    "if (\"busqueda:hoteles:jujuy\" not in r.keys(\"busqueda:hoteles:*\")):\n",
    "    hoteles_jujuy = db.hoteles.find(\n",
    "        {\"ciudad\": \"Jujuy\"}\n",
    "    )\n",
    "    for hotel in hoteles_jujuy:\n",
    "        print(f\"{hotel['nombre']}, {hotel['calificacion']} estrellas, servicios: {hotel['servicios']}, precio por noche: {hotel['precio']}\")\n",
    "        r.rpush(\"busqueda:hoteles:jujuy\", f\"{hotel['nombre']}, {hotel['calificacion']} estrellas, servicios: {hotel['servicios']}, precio por noche: {hotel['precio']}\")\n",
    "else:\n",
    "    for hotel in r.lrange(\"busqueda:hoteles:jujuy\", 0, -1):\n",
    "        print(hotel)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "58d4e441-c724-47c4-9dfc-dcbe493d37dc",
   "metadata": {},
   "source": [
    "#### j. Mostrar la cantidad de hoteles de un destino que guste."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "20cb8805-45f2-4b5a-aca1-115850ad125c",
   "metadata": {},
   "outputs": [],
   "source": [
    "if (\"busqueda:hoteles:cantidad:Madrid\" not in r.keys(\"busqueda:hoteles:*\")):\n",
    "    hoteles_madrid = db.hoteles.count_documents(\n",
    "        {\"ciudad\": \"Madrid\"}\n",
    "    )\n",
    "    r.set(\"busqueda:hoteles:cantidad:Madrid\", hoteles_madrid)\n",
    "print(f\"Cantidad de hoteles en Madrid: {r.get('busqueda:hoteles:cantidad:Madrid')}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8446f8b7-3610-4df8-9c7e-024e77aead12",
   "metadata": {},
   "source": [
    "#### k. Mostrar las actividades de “Ushuaia” del tipo “aventura”"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "777d2168-5b9f-4746-a723-c55711bec51b",
   "metadata": {},
   "outputs": [],
   "source": [
    "print(\"Actividades de tipo 'aventura' en Ushuaia:\")\n",
    "if (\"busqueda:actividades:aventura:ushuaia\" not in r.keys(\"busqueda:actividades:*\")):\n",
    "    ushuaia_aventura = db.actividades.find(\n",
    "        {\"ciudad\": \"Ushuaia\", \"tipo\": \"aventura\"},\n",
    "    )\n",
    "    for actividad in ushuaia_aventura:\n",
    "        print(f\"{actividad['nombre']}, precio: {actividad['precio']}\")\n",
    "        r.rpush(\"busqueda:actividades:aventura:ushuaia\", f\"{actividad['nombre']}, precio: {actividad['precio']}\")\n",
    "else:\n",
    "    for actividad in r.lrange(\"busqueda:actividades:aventura:ushuaia\", 0, -1):\n",
    "        print(actividad)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3dfc8bbb-0003-4a69-837a-4937d8741be8",
   "metadata": {},
   "source": [
    "#### l. Mostrar la cantidad de reservas concretadas de cada usuario. Mostrar el usuario y la cantidad"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 81,
   "id": "948b967f-6471-4395-be5e-97dbbe47d6c1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Cantidad de reservas por usuario:\n",
      "Usuario 1: 2\n",
      "Usuario 2: 2\n",
      "Usuario 3: 2\n",
      "Usuario 4: 1\n",
      "Usuario 5: 2\n",
      "Usuario 6: 0\n",
      "Usuario 7: 2\n",
      "Usuario 8: 1\n",
      "Usuario 9: 1\n",
      "Usuario 10: 1\n",
      "Usuario 11: 0\n",
      "Usuario 12: 2\n",
      "Usuario 13: 0\n",
      "Usuario 14: 1\n"
     ]
    }
   ],
   "source": [
    "print(\"Cantidad de reservas por usuario:\")\n",
    "if (\"busqueda:usuarios:cantidad:reservas\" not in r.keys(\"busqueda:usuarios:*\")):\n",
    "    reservas_por_usuario = db.usuarios.aggregate([\n",
    "        {\n",
    "            \"$lookup\": { # Juntamos en los usuarios sus reservas y se las guardamos en el campo \"reservas_usuario\"\n",
    "                \"from\": \"reservas\",\n",
    "                \"localField\": \"usuario_id\",\n",
    "                \"foreignField\": \"usuario_id\",\n",
    "                \"as\": \"reservas_usuario\"\n",
    "            }\n",
    "        },\n",
    "        {\n",
    "            \"$addFields\": { # Crea o sobreescribe un campo; el $size calcula cuantos elementos tiene \"reservas_usuario\" para obtener la cantidad\n",
    "                \"cantidad_reservas\": {\"$size\": \"$reservas_usuario\"}\n",
    "            }\n",
    "        },\n",
    "        {\n",
    "            \"$project\": { # Elegimos que campos mostar\n",
    "                \"usuario_id\": 1,\n",
    "                \"cantidad_reservas\": 1\n",
    "            }\n",
    "        },\n",
    "        { # Ordenamos en orden descendente por \"usuario_id\"\n",
    "            \"$sort\": {\"usuario_id\": 1}\n",
    "        }\n",
    "    ])\n",
    "    for usuario in reservas_por_usuario:\n",
    "        print(f\"Usuario {usuario['usuario_id']}: {usuario['cantidad_reservas']}\")\n",
    "        r.rpush(\"busqueda:usuarios:cantidad:reservas\", f\"Usuario {usuario['usuario_id']}: {usuario['cantidad_reservas']}\")\n",
    "else:\n",
    "    for usuario in r.lrange(\"busqueda:usuarios:cantidad:reservas\", 0, -1):\n",
    "        print(usuario)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "67a2a410",
   "metadata": {},
   "source": [
    "#### m-i. Destino más visitado."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6cedb4c9-81ee-4df7-8135-c2273d9beb29",
   "metadata": {},
   "outputs": [],
   "source": [
    "import matplotlib.pyplot as plt\n",
    "query = \"\"\"\n",
    "MATCH (n)-[:VISITO]->(d:Destino)\n",
    "WITH d, COUNT(n) as cantidad\n",
    "RETURN COLLECT(d.ciudad) AS destinos, COLLECT(cantidad) AS visitas\n",
    "\"\"\"\n",
    "visitas_por_destino = driver.session().run(query)\n",
    "for x in visitas_por_destino:\n",
    "    tabla = lambda y: [a for a in x]\n",
    "\n",
    "plt.figure(figsize=(12,6))\n",
    "plt.bar(tabla(visitas_por_destino)[0], tabla(visitas_por_destino)[1])\n",
    "plt.title('Visitas por destino')\n",
    "plt.ylabel('Cantidad de visitas')\n",
    "plt.show()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "32afaf90-9b29-4640-969f-c72beb06f323",
   "metadata": {},
   "source": [
    "#### m-ii. Hotel más barato."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5c1a63f9-a715-49c6-935c-a77d5dcd3dc3",
   "metadata": {},
   "outputs": [],
   "source": [
    "hoteles_baratos = db.hoteles.aggregate([\n",
    "    {\n",
    "        \"$project\": {\n",
    "            \"_id\": 0,\n",
    "            \"nombre\": 1,\n",
    "            \"precio\": 1\n",
    "        }\n",
    "    },\n",
    "    {\n",
    "        \"$sort\": {\"precio\": -1}\n",
    "    }\n",
    "])\n",
    "hoteles = []\n",
    "precios = []\n",
    "for hotel in hoteles_baratos:\n",
    "    hoteles.append(hotel[\"nombre\"])\n",
    "    precios.append(hotel[\"precio\"])\n",
    "    \n",
    "plt.figure(figsize=(8,4))\n",
    "plt.barh(hoteles, precios)\n",
    "plt.title('Precios por hotel')\n",
    "plt.ylabel('Hoteles')\n",
    "plt.xlabel('Precios')\n",
    "plt.show()\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "74d418d0-7c29-4783-a4b4-69fcfa8c4ad9",
   "metadata": {},
   "source": [
    "#### m-iii. Actividad más popular."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "60881d7e-cf91-4a9c-9a30-b4ff4a1a25e5",
   "metadata": {},
   "outputs": [],
   "source": [
    "#Contabilizamos la cantidad de actividades incluidos en las reservas efectivas\n",
    "consulta_actividades = db.reservas.aggregate([\n",
    "  {\n",
    "    \"$match\": { #Filtramos las reservas confirmadas, y que incluyan actividades\n",
    "            \"$nor\": [\n",
    "                {\"estado\" : \"Cancelada\"},\n",
    "                {\"estado\" : \"Pendiente\"}\n",
    "                    ],\n",
    "            \"paquete\": {\n",
    "                \"$exists\": True}\n",
    "        }\n",
    "  },\n",
    "  {\n",
    "    \"$unwind\": \"$paquete.actividades_incluidas\"  #Descomponemos la lista de actividades\n",
    "  },\n",
    "  {\n",
    "    \"$lookup\": { # Juntamos las reservas con las actividades\n",
    "            \"from\": \"actividades\",\n",
    "            \"localField\": \"paquete.actividades_incluidas\",\n",
    "            \"foreignField\": \"actividad_id\",\n",
    "            \"as\": \"actividad\"\n",
    "        }\n",
    "    },\n",
    "  {\n",
    "    \"$group\": {\n",
    "      \"_id\": \"$actividad.nombre\", #Agrupamos por nombre y contabilizamos\n",
    "      \"totalRealizaciones\": { \"$sum\": 1 }\n",
    "          }\n",
    "    },\n",
    "  {\n",
    "    \"$project\": {\n",
    "      \"actividad_nombre\": \"$_id\", #Seleccionamos los campos a mostrar\n",
    "      \"totalRealizaciones\": 1\n",
    "    }\n",
    "  },\n",
    "  {\n",
    "    \"$sort\": { \"totalRealizaciones\": -1 } #Ordenamos de mayor a menor\n",
    "  },\n",
    "  {\n",
    "    \"$limit\": 5 #Mostramos los primeros 5\n",
    "  }\n",
    "])\n",
    "act = []\n",
    "cant = []\n",
    "for a in consulta_actividades:\n",
    "    act.append(a['actividad_nombre'][0])\n",
    "    cant.append(a['totalRealizaciones'])\n",
    "plt.figure(figsize=(16,5))\n",
    "plt.bar(act, cant)\n",
    "plt.title('Actividades más populares')\n",
    "plt.xlabel('Actividades')\n",
    "plt.ylabel('Veces realizada')\n",
    "plt.show()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a71adbdc-4db9-47e4-8b72-d0d9657f76da",
   "metadata": {},
   "source": [
    "## 3. Modificar datos"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f3e98fa7-fbb2-4581-af29-6326edd3bfbd",
   "metadata": {},
   "source": [
    "#### a. Incrementar el precio de las actividades de Tucumán en 5%"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "830c4288-b0dc-44ba-a25b-05af04dd6050",
   "metadata": {},
   "outputs": [],
   "source": [
    "db.actividades.update_many(\n",
    "    {\"ciudad\": \"Tucumán\"},\n",
    "    {\"$mul\":{\"precio\": 1.05}}\n",
    ")\n",
    "act = db.actividades.find({\"ciudad\": \"Tucumán\"})\n",
    "for a in act:\n",
    "    print(f\"Ciudad: {a['ciudad']}, Actividad: {a['nombre']}, Nuevo precio: {a['precio']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0bb4b7eb-adee-43d2-969c-2f18679e6f27",
   "metadata": {},
   "source": [
    "#### b. Agregar al hotel id=1 el servicio de SPA"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9f726060-780e-4f1a-8a52-ab8fcf1f3e16",
   "metadata": {},
   "outputs": [],
   "source": [
    "db.hoteles.update_one(\n",
    "    {\"hotel_id\": 1},\n",
    "    {\"$addToSet\": {\"servicios\": \"spa\"}}\n",
    ")\n",
    "hotel = db.hoteles.find({\"hotel_id\": 1})\n",
    "for h in hotel:\n",
    "    print(f\"Hotel: {h['nombre']}. Servicios: {h['servicios']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "490615b9-20d7-4002-86b8-a31142a2ab1c",
   "metadata": {},
   "source": [
    "#### c. Eliminar el destino que desee"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5428da80-38a9-443a-b8f8-ab4ee1e61067",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Eliminamos Salta de las reservas temporales\n",
    "for reserva in r.keys(\"reserva:*\"):\n",
    "    if (r.hget(reserva, \"destino_id\")==\"9\"):\n",
    "        r.delete(key)\n",
    "\n",
    "# Eliminamos Salta, sus hoteles y sus actividades de MongoDB\n",
    "db.hoteles.delete_many(\n",
    "    {\"ciudad\": \"Salta\"}\n",
    ")\n",
    "db.actividades.delete_many(\n",
    "    {\"ciudad\": \"Salta\"}\n",
    ")\n",
    "db.destinos.delete_one(\n",
    "    {\"ciudad\": \"Salta\"}\n",
    ")\n",
    "# Acá no se si eliminar también las reservas pero por las dudas las dejo, sino el código sería:\n",
    "# db.reservas.delete_many(\n",
    "#     {\"destino_id\": 9}\n",
    "# )\n",
    "\n",
    "# Eliminamos Salta de Neo4j\n",
    "# Primero todas las relaciones donde se encuentra\n",
    "query = \"\"\"\n",
    "MATCH (u:Usuario)-[r:VISITO]->(d:Destino)\n",
    "WHERE d.ciudad = 'Salta'\n",
    "DELETE r\n",
    "\"\"\"\n",
    "driver.session().run(query)\n",
    "\n",
    "# Luego el nodo que contiene a la ciudad\n",
    "query = \"\"\"\n",
    "MATCH (d:Destino)\n",
    "WHERE d.ciudad='Salta'\n",
    "DELETE (d)\n",
    "\"\"\"\n",
    "driver.session().run(query)\n",
    "print(\"La ciudad de Salta fue eliminada con éxito.\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2927c669-ef09-4099-8c30-f510293f6bdd",
   "metadata": {},
   "source": [
    "#### d. Eliminar un usuario que desee"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "61b469cc-f9f0-4a29-9eb7-4509ef921c99",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Primero eliminamos sus sesiones activas y sus reservas temporales\n",
    "if \"sesion:usuario:5\" in r.keys(\"sesion:usuario:*\"):\n",
    "    r.delete(\"sesion:usuario:5\")\n",
    "for reserva in r.keys(\"reserva:*\"):\n",
    "    if (r.hget(reserva, \"id_usuario\")==\"5\"):\n",
    "        r.delete(reserva)\n",
    "\n",
    "# Ahora eliminamos al usuario y sus reservas de MongoDB\n",
    "db.reservas.delete_many(\n",
    "    {\"usuario_id\": 5}\n",
    ")\n",
    "db.usuarios.delete_one(\n",
    "    {\"usuario_id\": 5}\n",
    ")\n",
    "\n",
    "# Por último eliminamos al usuario y a todas sus relaciones de Neo4j\n",
    "query = \"\"\"\n",
    "MATCH (u:Usuario)-[r]->()\n",
    "WHERE u.usuario_id = 5\n",
    "DELETE r\n",
    "\"\"\"\n",
    "driver.session().run(query)\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH ()-[r]->(u:Usuario)\n",
    "WHERE u.usuario_id = 5\n",
    "DELETE r\n",
    "\"\"\"\n",
    "driver.session().run(query)\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (u:Usuario)\n",
    "WHERE u.usuario_id = 5\n",
    "DELETE u\n",
    "\"\"\"\n",
    "driver.session().run(query)\n",
    "\n",
    "print(\"El usuario 5, Ana Torres, fue eliminado con éxito.\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3aec13ed-6a69-4aaf-8ecb-c638283095a9",
   "metadata": {},
   "source": [
    "#### e. Eliminar las relaciones AMIGO_DE para un usuario que desee"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3f424e23-573b-4b61-93b8-768e1f87e62d",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Eliminamos las relaciones de amigo hacia otros usuarios\n",
    "query = \"\"\"\n",
    "MATCH (u:Usuario)-[r:AMIGO_DE]->()\n",
    "WHERE u.usuario_id = 13\n",
    "DELETE r\n",
    "\"\"\"\n",
    "driver.session().run(query)\n",
    "\n",
    "# Eliminamos las relaciones de amigo hacia el usuario elegido\n",
    "query = \"\"\"\n",
    "MATCH ()-[r:AMIGO_DE]->(u:Usuario)\n",
    "WHERE u.usuario_id = 13\n",
    "DELETE r\n",
    "\"\"\"\n",
    "driver.session().run(query)\n",
    "\n",
    "print(\"Las relaciones AMIGO_DE del usuario 13 han sido eliminadas con éxito.\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a4648e38-e0e1-4634-8a24-4a30b528a9fe",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.14"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
